---
kind: other
id: Methods.T:Autodesk.Revit.DB.ParameterFilterElement
source: html/87c3a177-df18-2846-b5a4-690363bd7bde.htm
---
# ParameterFilterElement Methods

Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.